package ru.yandex.practicum.dto.shoppingStore;

/**
 * Представляет собой классификацию всех доступных устройств Smart Home Technologies
 * по функциональному назначению. Каждая категория объединяет устройства со схожими
 * характеристиками и предназначением.
 *
 * Доступные категории:
 *
 * LIGHTING - устройства, связанные с управлением освещением
 * CONTROL - устройства управления умным домом
 * SENSORS - различные датчики для мониторинга параметров окружающей среды
 */
public enum ProductCategory {
    LIGHTING, CONTROL, SENSORS
}
